[bits 16]         ; Вказуємо, що це 16-бітний режим
[org 0x7c00]      ; Стандартна адреса завантаження

start:
    mov si, msg   ; Завантажуємо адресу рядка в регістр SI
    call print    ; Викликаємо функцію друку
    jmp $         ; Нескінченний цикл (зависаємо)

print:
    mov ah, 0x0e  ; Функція BIOS для виводу символу
.loop:
    lodsb         ; Беремо наступний символ
    or al, al     ; Перевіряємо на нуль (кінець рядка)
    jz .done
    int 0x10      ; Викликаємо переривання відео-сервісу BIOS
    jmp .loop
.done:
    ret

msg db 'FG BIOS v0.1 by Davidegrait', 0

times 510-($-$$) db 0 ; Заповнюємо нулями до 510 байт
dw 0xaa55             ; Магічне число завантажувального сектора